<?php

// resources/lang/ru/admin/controllers/athletes.php

return [

    // Общие действия
    'created' => 'Спортсмен успешно создан',
    'create_error' => 'Произошла ошибка при сохранении спортсмена',
    'updated' => 'Спортсмен успешно обновлён',
    'update_error' => 'Произошла ошибка при обновлении спортсмена',
    'deleted' => 'Спортсмен удалён',
    'delete_error' => 'Ошибка удаления спортсмена',
    'index_error' => 'Не удалось загрузить список постов.',

    // Массовые операции
    'bulk_deleted' => 'Выбранные спортсмена (:count шт.) успешно удалены.',
    'bulk_delete_error' => 'Произошла ошибка при массовом удалении статей.',
    'bulk_left_update_error' => 'Ошибка массового обновления активности в левой колонке.',
    'bulk_main_update_error' => 'Ошибка массового обновления активности в главной колонке.',
    'bulk_right_update_error' => 'Ошибка массового обновления активности в правой колонке.',

    // Активность
    'activated' => 'активирована',
    'deactivated' => 'деактивирована',
    'activity' => 'Спортсмен ":title" была :action.',
    'update_activity_error' => 'Ошибка обновления активности',

    // Сортировка
    'update_sort_success' => 'Сортировка спортсмена успешно обновлена.',
    'update_sort_error' => 'Ошибка обновления сортировки',
    'bulk_sort_updated' => 'Порядок спортсменов успешно обновлен.',
    'bulk_update_sort_error' => 'Ошибка массового обновления сортировки',

];
