<?php

// resources/lang/ru/admin/controllers/tournaments.php

return [

    // Общие действия
    'created' => 'Турнир успешно создан',
    'create_error' => 'Произошла ошибка при сохранении турнира',
    'updated' => 'Турнир успешно обновлён',
    'update_error' => 'Произошла ошибка при обновлении турнира',
    'deleted' => 'Турнир удалён',
    'delete_error' => 'Ошибка удаления турнира',
    'index_error' => 'Не удалось загрузить список турниров.',

    // Массовые операции
    'bulk_deleted' => 'Выбранные турниры (:count шт.) успешно удалены.',
    'bulk_delete_error' => 'Произошла ошибка при массовом удалении турниров.',

    // Активность
    'activated' => 'активирован',
    'deactivated' => 'деактивирован',
    'activity' => 'Турнир ":title" была :action.',
    'update_activity_error' => 'Ошибка обновления активности',

    // Сортировка
    'update_sort_success' => 'Сортировка турнира успешно обновлена.',
    'update_sort_error' => 'Ошибка обновления сортировки',
    'bulk_sort_updated' => 'Порядок турниров успешно обновлен.',
    'bulk_update_sort_error' => 'Ошибка массового обновления сортировки',

];
