<?php

// resources/lang/kk/admin/controllers/athletes.php

return [

    // Жалпы әрекеттер
    'created' => 'Спортшы сәтті құрылды',
    'create_error' => 'Спортшыны сақтау кезінде қате орын алды',
    'updated' => 'Спортшы сәтті жаңартылды',
    'update_error' => 'Спортшыны жаңарту кезінде қате орын алды',
    'deleted' => 'Спортшы жойылды',
    'delete_error' => 'Спортшыны жою қатесі',
    'index_error' => 'Пост тізімі жүктелмеді.',

    // Жаппай операциялар
    'bulk_deleted' => 'Таңдалған спортшылар (:count) сәтті жойылды.',
    'bulk_delete_error' => 'Мақалаларды жаппай жою кезінде қате орын алды.',
    'bulk_left_update_error' => 'Сол жақ бағандағы әрекетті жаппай жаңарту қатесі.',
    'bulk_main_update_error' => 'Негізгі бағандағы әрекетті жаппай жаңарту қатесі.',
    'bulk_right_update_error' => 'Оң жақ бағандағы әрекетті жаппай жаңарту қатесі.',

    // Әрекет
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'activity' => 'Спортшы ":title" болды :әрекет.',
    'update_activity_error' => 'Әрекетті жаңарту қатесі',

    // Сұрыптау
    'update_sort_success' => 'Спортшыларды сұрыптау сәтті жаңартылды.',
    'update_sort_error' => 'Сұрыптауды жаңарту қатесі',
    'bulk_sort_updated' => 'Спортшының тапсырысы сәтті жаңартылды.',
    'bulk_update_sort_error' => 'Жаппай жаңарту сұрыптау қатесі',

];
