<?php

// resources/lang/kk/admin/controllers/tournaments.php

return [

    // Жалпы әрекеттер
    'created' => 'Турнир сәтті құрылды.',
    'updated' => 'Турнир сәтті жаңартылды.',
    'deleted' => 'Турнир және қатысты суреттер жойылды.',
    'create_error' => 'Турнир құру кезінде қате орын алды.',
    'update_error' => 'Турнирді жаңарту кезінде қате орын алды.',
    'delete_error' => 'Турнирді жою кезінде қате орын алды.',
    'index_error' => 'Турнирлер тізімін жүктеу сәтсіз аяқталды.',

    // Жаппай операциялар
    'bulk_deleted' => 'Таңдалған турнирлер (:санау дана) сәтті жойылды.',
    'bulk_delete_error' => 'Турнирлерді жаппай жою кезінде қате орын алды.',
    'bulk_left_update_error' => 'Сол жақ бағандағы әрекетті жаппай жаңарту қатесі.',
    'bulk_main_update_error' => 'Негізгі бағандағы әрекетті жаппай жаңарту қатесі.',
    'bulk_right_update_error' => 'Оң жақ бағандағы әрекетті жаппай жаңарту қатесі.',

    // Әрекет
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'activity' => 'Турнир ":title" :action болды.',
    'update_activity_error' => 'Әрекетті жаңарту кезінде қате орын алды.',

    // Сұрыптау
    'update_sort_success' => 'Турнирді сұрыптау сәтті жаңартылды.',
    'update_sort_error' => 'Турнир сұрыптауын жаңарту қатесі.',
    'bulk_sort_updated' => 'Турнир тапсырысы сәтті жаңартылды.',
    'bulk_sort_update_error' => 'Турнир тәртібін жаппай жаңарту қатесі.',

    // Клондау
    'cloned' => 'Турнир сәтті клондалды.',
    'clone_error' => 'Турнирді клондау қатесі.',

    // Сол, оң жақ бүйірлік тақта және негізгі
    'left_updated' => 'Турнир сол жақ бағанда сәтті жаңартылды.',
    'right_updated' => 'Турнир оң жақ бағанда сәтті жаңартылды.',
    'main_updated' => 'Турнир негізгі бағанда сәтті жаңартылды.',
    'left_update_error' => 'Сол жақ бағандағы әрекетті жаңарту қатесі.',
    'right_update_error' => 'Оң жақ бағандағы әрекетті жаңарту қатесі.',
    'main_update_error' => 'Негізгі бағандағы әрекетті жаңарту қатесі.',

];
