<?php

// resources/lang/kk/admin/controllers/videos.php

return [

    // Жалпы әрекеттер
    'created' => 'Бейне сәтті жасалды.',
    'updated' => 'Бейне сәтті жаңартылды.',
    'deleted' => 'Бейне және байланысты суреттер жойылды.',
    'create_error' => 'Бейнені жасау кезінде қате болды.',
    'update_error' => 'Бейнені жаңарту кезінде қате орын алды.',
    'delete_error' => 'Бейнені жою кезінде қате болды.',
    'index_error' => 'Бейне тізімі жүктелмеді.',

    // Жаппай операциялар
    'bulk_deleted' => 'Таңдалған бейнелер (:count) сәтті жойылды.',
    'bulk_delete_error' => 'Бейнелерді жаппай жою кезінде қате орын алды.',
    'bulk_left_update_error' => 'Сол жақ бағандағы әрекетті жаппай жаңарту қатесі.',
    'bulk_main_update_error' => 'Негізгі бағандағы әрекетті жаппай жаңарту қатесі.',
    'bulk_right_update_error' => 'Оң жақ бағандағы әрекетті жаппай жаңарту қатесі.',

    // Әрекет
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'activity' => 'Бейне ":title" :әрекет болды.',
    'update_activity_error' => 'Әрекетті жаңарту кезінде қате орын алды.',

    // Сұрыптау
    'update_sort_success' => 'Бейне сұрыптау сәтті жаңартылды.',
    'update_sort_error' => 'Бейнені сұрыптауды жаңарту қатесі.',
    'bulk_sort_updated' => 'Бейне тәртібі сәтті жаңартылды.',
    'bulk_sort_update_error' => 'Бейне ретін жаппай жаңарту қатесі.',

    // Клондау
    'cloned' => 'Бейне сәтті клондалды.',
    'clone_error' => 'Бейнені клондау қатесі.',

    // Сол, оң жақ бүйірлік тақта және негізгі
    'left_updated' => 'Бейне сол жақ бағанда сәтті жаңартылды.',
    'right_updated' => 'Бейне оң жақ бағанда сәтті жаңартылды.',
    'main_updated' => 'Бейне негізгі бағанда сәтті жаңартылды.',
    'left_update_error' => 'Сол жақ бағандағы әрекетті жаңарту қатесі.',
    'right_update_error' => 'Оң жақ бағандағы әрекетті жаңарту қатесі.',
    'main_update_error' => 'Негізгі бағандағы әрекетті жаңарту қатесі.',

];
